FIRST_RUN/app/controllers/pictures_controller.rb

  def index
    @pictures = Picture.all
---
SELECT "pictures".* FROM "pictures" WHERE (created_at > '2017-10-01 00:00:00')

  def create
    @picture = Picture.new

    @picture.title = params[:picture][:title]
    @picture.artist = params[:picture][:artist]
    @picture.url = params[:picture][:url]


    if @picture.save
---
INSERT INTO "pictures" ("artist", "title", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["artist", "New Artist 1"], ["title", "New Title 2"], ["url", "new url"], ["created_at", 2017-08-29 18:45:48 UTC], ["updated_at", 2017-08-29 18:45:48 UTC]]

  def update
    @picture = Picture.find(params[:id])

    @picture.title = params[:picture][:title]
    @picture.artist = params[:picture][:artist]
    @picture.url = params[:picture][:url]
    @picture.created_at = params[:picture][:created_at]


    if @picture.save
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "pictures" SET "url" = ?, "updated_at" = ? WHERE "pictures"."id" = ?  [["url", "http://bitmakerlabs.s3.amazonaws.com/photogur/wave.jpg"], ["updated_at", 2017-08-30 18:13:40 UTC], ["id", 4]]