FIRST_RUN/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "summary", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Test Post #4"], ["summary", "This is a test post"], ["created_at", 2017-08-30 18:41:40 UTC], ["updated_at", 2017-08-30 18:41:40 UTC]]
---
  def create
    @post = Post.new

    @post.title = params[:post][:title]
    @post.summary = params[:post][:summary]
    @post.date = params[:post][:date]


    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "First Post - edited"], ["updated_at", 2017-08-30 18:37:22 UTC], ["id", 1]]
---
  def update
    @post = Post.find(params[:id])

    @post.title = params[:post][:title]
    @post.summary = params[:post][:summary]
    @post.date = params[:post][:date]


    if @post.save