FIRST_RUN/app/controllers/users_controller.rb

  def create
    @user = User.new

    @user.email = params[:user][:email]
    @user.password = params[:user][:password]
    @user.password_confirmation = params[:user][:password_confirmation]

    if @user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "marlon@email.com"], ["password_digest", "$2a$10$mYeRpm7TdRFb0gPigiqRkuwqoMBsztWZH1GMaH21oH0Ju/bTU.oUC"], ["created_at", 2017-09-09 16:57:33 UTC], ["updated_at", 2017-09-09 16:57:33 UTC]]